In [1]:
import pandas as pd
import pathlib as path

In [2]:
pwd

'C:\\Users\\bekhr\\Desktop\\python-challenge\\PyBank'

In [3]:
path = "C:/Users/bekhr/Desktop/Bootcamp/2.4/Starter_Code/Starter_Code/PyBank/Resources/budget_data.csv"

In [4]:
budget_data = pd.read_csv(path)

In [5]:
budget_data

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [6]:
analysis = {}

In [7]:
budget_data.count()

Date             86
Profit/Losses    86
dtype: int64

In [8]:
budget_data

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [13]:
budget_data

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [26]:

total_months = len(df.index)
total = df['Profit/Losses'].sum()
average_change = 0 #  df['Profit/Losses'].pct_change().sum()

greatest_increase = {'date': df[:].max()['Date'], 'total': df[:].max()['Profit/Losses']}
greatest_decrease = {'date': df[:].min()['Date'], 'total': df[:].min()['Profit/Losses']}

print(
f"""
Total Months: {total_months}
Total:{total}
Average Change: {average_change}
Greatest Increase in Profits: {greatest_increase['date']} (${greatest_increase['total']})
Greatest Decrease in Profits: {greatest_decrease['date']} (${greatest_decrease['total']})
""")

Total Months: 86
Total:38382578
Average Change: 0
Greatest Increase in Profits: Sep-2016 ($1170593)
Greatest Decrease in Profits: Apr-2010 ($-1196225)